burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_syscfg.h
/* SYSCFG_SCS */
#define SYSCFG_SCS_SRAM1ERS                     BIT(0)                                            /*!< SRAM1 erase */
#define SYSCFG_SCS_SRAM1BSY                     BIT(1)                                            /*!< SRAM1 busy by erase operation */

/* SYSCFG_SKEY */
#define SYSCFG_SKEY_KEY                         BITS(0,7)                                         /*!< SRAM1 write protection key for software erase */

/* SYSCFG_SWP0 */
#define SYSCFG_SWP0_P0WP                        BIT(0)                                            /*!< SRAM1 1 Kbyte page 0 write protection */
#define SYSCFG_SWP0_P1WP                        BIT(1)                                            /*!< SRAM1 1 Kbyte page 1 write protection */
#define SYSCFG_SWP0_P2WP                        BIT(2)                                            /*!< SRAM1 1 Kbyte page 2 write protection */
#define SYSCFG_SWP0_P3WP                        BIT(3)                                            /*!< SRAM1 1 Kbyte page 3 write protection */
#define SYSCFG_SWP0_P4WP                        BIT(4)                                            /*!< SRAM1 1 Kbyte page 4 write protection */
#define SYSCFG_SWP0_P5WP                        BIT(5)                                            /*!< SRAM1 1 Kbyte page 5 write protection */
#define SYSCFG_SWP0_P6WP                        BIT(6)                                            /*!< SRAM1 1 Kbyte page 6 write protection */
#define SYSCFG_SWP0_P7WP                        BIT(7)                                            /*!< SRAM1 1 Kbyte page 7 write protection */
#define SYSCFG_SWP0_P8WP                        BIT(8)                                            /*!< SRAM1 1 Kbyte page 8 write protection */
#define SYSCFG_SWP0_P9WP                        BIT(9)                                            /*!< SRAM1 1 Kbyte page 9 write protection */
#define SYSCFG_SWP0_P10WP                       BIT(10)                                           /*!< SRAM1 1 Kbyte page 10 write protection */
#define SYSCFG_SWP0_P11WP                       BIT(11)                                           /*!< SRAM1 1 Kbyte page 11 write protection */
#define SYSCFG_SWP0_P12WP                       BIT(12)                                           /*!< SRAM1 1 Kbyte page 12 write protection */
#define SYSCFG_SWP0_P13WP                       BIT(13)                                           /*!< SRAM1 1 Kbyte page 13 write protection */
#define SYSCFG_SWP0_P14WP                       BIT(14)                                           /*!< SRAM1 1 Kbyte page 14 write protection */
#define SYSCFG_SWP0_P15WP                       BIT(15)                                           /*!< SRAM1 1 Kbyte page 15 write protection */
#define SYSCFG_SWP0_P16WP                       BIT(16)                                           /*!< SRAM1 1 Kbyte page 16 write protection */
#define SYSCFG_SWP0_P17WP                       BIT(17)                                           /*!< SRAM1 1 Kbyte page 17 write protection */
#define SYSCFG_SWP0_P18WP                       BIT(18)                                           /*!< SRAM1 1 Kbyte page 18 write protection */
#define SYSCFG_SWP0_P19WP                       BIT(19)                                           /*!< SRAM1 1 Kbyte page 19 write protection */
#define SYSCFG_SWP0_P20WP                       BIT(20)                                           /*!< SRAM1 1 Kbyte page 20 write protection */
#define SYSCFG_SWP0_P21WP                       BIT(21)                                           /*!< SRAM1 1 Kbyte page 21 write protection */
#define SYSCFG_SWP0_P22WP                       BIT(22)                                           /*!< SRAM1 1 Kbyte page 22 write protection */
#define SYSCFG_SWP0_P23WP                       BIT(23)                                           /*!< SRAM1 1 Kbyte page 23 write protection */
#define SYSCFG_SWP0_P24WP                       BIT(24)                                           /*!< SRAM1 1 Kbyte page 24 write protection */
#define SYSCFG_SWP0_P25WP                       BIT(25)                                           /*!< SRAM1 1 Kbyte page 25 write protection */
#define SYSCFG_SWP0_P26WP                       BIT(26)                                           /*!< SRAM1 1 Kbyte page 26 write protection */
#define SYSCFG_SWP0_P27WP                       BIT(27)                                           /*!< SRAM1 1 Kbyte page 27 write protection */
#define SYSCFG_SWP0_P28WP                       BIT(28)                                           /*!< SRAM1 1 Kbyte page 28 write protection */
#define SYSCFG_SWP0_P29WP                       BIT(29)                                           /*!< SRAM1 1 Kbyte page 29 write protection */
#define SYSCFG_SWP0_P30WP                       BIT(30)                                           /*!< SRAM1 1 Kbyte page 30 write protection */
#define SYSCFG_SWP0_P31WP                       BIT(31)                                           /*!< SRAM1 1 Kbyte page 31 write protection */

/* SYSCFG_SWPR1 */
#define SYSCFG_SWP1_P32WP                       BIT(0)                                            /*!< SRAM1 1 Kbyte page 32 write protection */
#define SYSCFG_SWP1_P33WP                       BIT(1)                                            /*!< SRAM1 1 Kbyte page 33 write protection */
#define SYSCFG_SWP1_P34WP                       BIT(2)                                            /*!< SRAM1 1 Kbyte page 34 write protection */
#define SYSCFG_SWP1_P35WP                       BIT(3)                                            /*!< SRAM1 1 Kbyte page 35 write protection */
#define SYSCFG_SWP1_P36WP                       BIT(4)                                            /*!< SRAM1 1 Kbyte page 36 write protection */
#define SYSCFG_SWP1_P37WP                       BIT(5)                                            /*!< SRAM1 1 Kbyte page 37 write protection */
#define SYSCFG_SWP1_P38WP                       BIT(6)                                            /*!< SRAM1 1 Kbyte page 38 write protection */
#define SYSCFG_SWP1_P39WP                       BIT(7)                                            /*!< SRAM1 1 Kbyte page 39 write protection */
#define SYSCFG_SWP1_P40WP                       BIT(8)                                            /*!< SRAM1 1 Kbyte page 40 write protection */
#define SYSCFG_SWP1_P41WP                       BIT(9)                                            /*!< SRAM1 1 Kbyte page 41 write protection */
#define SYSCFG_SWP1_P42WP                       BIT(10)                                           /*!< SRAM1 1 Kbyte page 42 write protection */
#define SYSCFG_SWP1_P43WP                       BIT(11)                                           /*!< SRAM1 1 Kbyte page 43 write protection */
#define SYSCFG_SWP1_P44WP                       BIT(12)                                           /*!< SRAM1 1 Kbyte page 44 write protection */
#define SYSCFG_SWP1_P45WP                       BIT(13)                                           /*!< SRAM1 1 Kbyte page 45 write protection */
#define SYSCFG_SWP1_P46WP                       BIT(14)                                           /*!< SRAM1 1 Kbyte page 46 write protection */
#define SYSCFG_SWP1_P47WP                       BIT(15)                                           /*!< SRAM1 1 Kbyte page 47 write protection */
#define SYSCFG_SWP1_P48WP                       BIT(16)                                           /*!< SRAM1 1 Kbyte page 48 write protection */
#define SYSCFG_SWP1_P49WP                       BIT(17)                                           /*!< SRAM1 1 Kbyte page 49 write protection */
#define SYSCFG_SWP1_P50WP                       BIT(18)                                           /*!< SRAM1 1 Kbyte page 50 write protection */
#define SYSCFG_SWP1_P51WP                       BIT(19)                                           /*!< SRAM1 1 Kbyte page 51 write protection */
#define SYSCFG_SWP1_P52WP                       BIT(20)                                           /*!< SRAM1 1 Kbyte page 52 write protection */
#define SYSCFG_SWP1_P53WP                       BIT(21)                                           /*!< SRAM1 1 Kbyte page 53 write protection */
#define SYSCFG_SWP1_P54WP                       BIT(22)                                           /*!< SRAM1 1 Kbyte page 54 write protection */
#define SYSCFG_SWP1_P55WP                       BIT(23)                                           /*!< SRAM1 1 Kbyte page 55 write protection */
#define SYSCFG_SWP1_P56WP                       BIT(24)                                           /*!< SRAM1 1 Kbyte page 56 write protection */
#define SYSCFG_SWP1_P57WP                       BIT(25)                                           /*!< SRAM1 1 Kbyte page 57 write protection */
#define SYSCFG_SWP1_P58WP                       BIT(26)                                           /*!< SRAM1 1 Kbyte page 58 write protection */
#define SYSCFG_SWP1_P59WP                       BIT(27)                                           /*!< SRAM1 1 Kbyte page 59 write protection */
#define SYSCFG_SWP1_P60WP                       BIT(28)                                           /*!< SRAM1 1 Kbyte page 60 write protection */
#define SYSCFG_SWP1_P61WP                       BIT(29)                                           /*!< SRAM1 1 Kbyte page 61 write protection */
#define SYSCFG_SWP1_P62WP                       BIT(30)                                           /*!< SRAM1 1 Kbyte page 62 write protection */
#define SYSCFG_SWP1_P63WP                       BIT(31)                                           /*!< SRAM1 1 Kbyte page 63 write protection */

/* SYSCFG_GSSACMD */
#define SYSCFG_GSSACMD_GSSACMD                  BITS(0,7)                                         /*!< GSSA commands */

#if defined (GD32F5HC)
/* SYSCFG_TIMERxCFG bits definitions */
#define SYSCFG_TIMERCFG_TSCFG0                  BITS(0,3)                                         /*!< Quadrature decoder mode 0 configuration */
#define SYSCFG_TIMERCFG_TSCFG1                  BITS(4,7)                                         /*!< Quadrature decoder mode 1 configuration */
#define SYSCFG_TIMERCFG_TSCFG2                  BITS(8,11)                                        /*!< Quadrature decoder mode 2 configuration */
#define SYSCFG_TIMERCFG_TSCFG3                  BITS(12,15)                                       /*!< Restart mode configuration */
#define SYSCFG_TIMERCFG_TSCFG4                  BITS(16,19)                                       /*!< Pause mode configuration */
#define SYSCFG_TIMERCFG_TSCFG5                  BITS(20,23)                                       /*!< Event mode configuration */
#define SYSCFG_TIMERCFG_TSCFG6                  BITS(24,27)                                       /*!< External clock mode 0 configuration */
#define SYSCFG_TIMERCFG_TSCFG7                  BITS(28,31)                                       /*!< Internal trigger input source configuration */
#endif /* defined (GD32F5HC) */

/* constants definitions */
/* EXTI source select definition */
#define EXTISS0                                 ((uint8_t)0x00U)                                  /*!< EXTI source select register 0 */
#define EXTISS1                                 ((uint8_t)0x01U)                                  /*!< EXTI source select register 1 */
#define EXTISS2                                 ((uint8_t)0x02U)                                  /*!< EXTI source select register 2 */
#define EXTISS3                                 ((uint8_t)0x03U)                                  /*!< EXTI source select register 3 */

