burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_syscfg.h
/* EXTI source select mask bits definition */
#define EXTI_SS_MASK                            BITS(0,3)                                         /*!< EXTI source select mask */

/* EXTI source select jumping step definition */
#define EXTI_SS_JSTEP                           ((uint8_t)(0x04U))                                /*!< EXTI source select jumping step */

/* EXTI source select moving step definition */
#define EXTI_SS_MSTEP(pin)                      (EXTI_SS_JSTEP * ((pin) % EXTI_SS_JSTEP))         /*!< EXTI source select moving step */

/* EXTI source port definitions */
#define EXTI_SOURCE_GPIOA                       ((uint8_t)0x00U)                                  /*!< EXTI GPIOA configuration */
#define EXTI_SOURCE_GPIOB                       ((uint8_t)0x01U)                                  /*!< EXTI GPIOB configuration */
#define EXTI_SOURCE_GPIOC                       ((uint8_t)0x02U)                                  /*!< EXTI GPIOC configuration */
#if defined (GD32F5HC)
#define EXTI_SOURCE_GPIOD                       ((uint8_t)0x03U)                                  /*!< EXTI GPIOD configuration */
#endif /* defined (GD32F5HC) */

/* EXTI source pin definitions */
#define EXTI_SOURCE_PIN0                        ((uint8_t)0x00U)                                  /*!< EXTI GPIO pin0 configuration */
#define EXTI_SOURCE_PIN1                        ((uint8_t)0x01U)                                  /*!< EXTI GPIO pin1 configuration */
#define EXTI_SOURCE_PIN2                        ((uint8_t)0x02U)                                  /*!< EXTI GPIO pin2 configuration */
#define EXTI_SOURCE_PIN3                        ((uint8_t)0x03U)                                  /*!< EXTI GPIO pin3 configuration */
#define EXTI_SOURCE_PIN4                        ((uint8_t)0x04U)                                  /*!< EXTI GPIO pin4 configuration */
#define EXTI_SOURCE_PIN5                        ((uint8_t)0x05U)                                  /*!< EXTI GPIO pin5 configuration */
#define EXTI_SOURCE_PIN6                        ((uint8_t)0x06U)                                  /*!< EXTI GPIO pin6 configuration */
#define EXTI_SOURCE_PIN7                        ((uint8_t)0x07U)                                  /*!< EXTI GPIO pin7 configuration */
#define EXTI_SOURCE_PIN8                        ((uint8_t)0x08U)                                  /*!< EXTI GPIO pin8 configuration */
#define EXTI_SOURCE_PIN9                        ((uint8_t)0x09U)                                  /*!< EXTI GPIO pin9 configuration */
#define EXTI_SOURCE_PIN10                       ((uint8_t)0x0AU)                                  /*!< EXTI GPIO pin10 configuration */
#define EXTI_SOURCE_PIN11                       ((uint8_t)0x0BU)                                  /*!< EXTI GPIO pin11 configuration */
#define EXTI_SOURCE_PIN12                       ((uint8_t)0x0CU)                                  /*!< EXTI GPIO pin12 configuration */
#define EXTI_SOURCE_PIN13                       ((uint8_t)0x0DU)                                  /*!< EXTI GPIO pin13 configuration */
#define EXTI_SOURCE_PIN14                       ((uint8_t)0x0EU)                                  /*!< EXTI GPIO pin14 configuration */
#define EXTI_SOURCE_PIN15                       ((uint8_t)0x0FU)                                  /*!< EXTI GPIO pin15 configuration */

/* security definitions */
#define SYSCFG_SECURE_ACCESS                    SYSCFG_SECCFG_SYSCFGSE                            /*!< SYSCFG configuration clock in RCU registers can be written by secure access only */
#define SYSCFG_SECURE_NONSECURE_ACCESS          (~SYSCFG_SECCFG_SYSCFGSE)                         /*!< SYSCFG configuration clock in RCU registers can be written by secure and nonsecure access */

#define CLASSB_SECURE_ACCESS                    SYSCFG_SECCFG_CLASSBSE                            /*!< SYSCFG_CFG1 register can be written by secure access only */
#define CLASSB_SECURE_NONSECURE_ACCESS          (~SYSCFG_SECCFG_CLASSBSE)                         /*!< SYSCFG_CFG1 register can be written by secure and non-secure access */

#define SRAM1_SECURE_ACCESS                     SYSCFG_SECCFG_SRAM1SE                             /*!< SYSCFG_SKEY, SYSCFG_SCS and SYSCFG_SWPx registers can be written by secure only */
#define SRAM1_SECURE_NONSECURE_ACCESS           (~SYSCFG_SECCFG_SRAM1SE)                          /*!< SYSCFG_SKEY, SYSCFG_SCS and SYSCFG_SWPx registers can be written by secure and non-secure access */

#define FPU_SECURE_ACCESS                       SYSCFG_SECCFG_FPUSE                               /*!< SYSCFG_FPUINTEN register can be written by secure access only */
#define FPU_SECURE_NONSECURE_ACCESS             (~SYSCFG_SECCFG_FPUSE)                            /*!< SYSCFG_FPUINTEN register can be written by secure and non-secure access */

/* fpu interrupt definitions */
#define INVALID_OPERATION_INT                   SYSCFG_FPUINTEN_IOPIE                             /*!< invalid operation Interrupt */
#define DIVIDE_BY_ZERO_INT                      SYSCFG_FPUINTEN_DZIE                              /*!< divide-by-zero interrupt */
#define UNDERFLOW_INT                           SYSCFG_FPUINTEN_UFIE                              /*!< underflow interrupt */
#define OVERFLOW_INT                            SYSCFG_FPUINTEN_OVFIE                             /*!< overflow interrupt */
#define INPUT_ABNORMAL_INT                      SYSCFG_FPUINTEN_IDIE                              /*!< input abnormal interrupt */
#define INEXACT_INT                             SYSCFG_FPUINTEN_IXIE                              /*!< inexact interrupt */

/* lock definitions */
#define SYSCFG_LOCK_LOCKUP                      SYSCFG_CFG1_LOCKUP_LOCK                           /*!< LOCKUP output lock*/
#define SYSCFG_LOCK_LVD                         SYSCFG_CFG1_LVD_LOCK                              /*!< LVD lock */

/* SRAM1 status definition */
#define SRAM1_BSY_FLAG                          SYSCFG_SCS_SRAM1BSY                               /*!< SRAM1 erase operation is ongoing */

/* SRAM1ERS unlock key */
#define SRAM1ERS_UNLOCK_KEY0                    ((uint8_t)0xCA)                                   /*!< unlock key0 */
#define SRAM1ERS_UNLOCK_KEY1                    ((uint8_t)0x53)                                   /*!< unlock key1 */
#define SRAM1ERS_LOCK_KEY0                      ((uint8_t)0x11)                                   /*!< lock key0 */
#define SRAM1ERS_LOCK_KEY1                      ((uint8_t)0x22)                                   /*!< lock key1 */

/* SRAM1 write protection definitions */
#define SRAM1_PAGE0_WRITE_PROTECT               SYSCFG_SWP0_P0WP                                  /*!<SRAM1 page 0 write protection */
#define SRAM1_PAGE1_WRITE_PROTECT               SYSCFG_SWP0_P1WP                                  /*!<SRAM1 page 1 write protection */
#define SRAM1_PAGE2_WRITE_PROTECT               SYSCFG_SWP0_P2WP                                  /*!<SRAM1 page 2 write protection */
#define SRAM1_PAGE3_WRITE_PROTECT               SYSCFG_SWP0_P3WP                                  /*!<SRAM1 page 3 write protection */
#define SRAM1_PAGE4_WRITE_PROTECT               SYSCFG_SWP0_P4WP                                  /*!<SRAM1 page 4 write protection */
#define SRAM1_PAGE5_WRITE_PROTECT               SYSCFG_SWP0_P5WP                                  /*!<SRAM1 page 5 write protection */
#define SRAM1_PAGE6_WRITE_PROTECT               SYSCFG_SWP0_P6WP                                  /*!<SRAM1 page 6 write protection */
#define SRAM1_PAGE7_WRITE_PROTECT               SYSCFG_SWP0_P7WP                                  /*!<SRAM1 page 7 write protection */
#define SRAM1_PAGE8_WRITE_PROTECT               SYSCFG_SWP0_P8WP                                  /*!<SRAM1 page 8 write protection */
#define SRAM1_PAGE9_WRITE_PROTECT               SYSCFG_SWP0_P9WP                                  /*!<SRAM1 page 9 write protection */
#define SRAM1_PAGE10_WRITE_PROTECT              SYSCFG_SWP0_P10WP                                 /*!<SRAM1 page 10 write protection */
#define SRAM1_PAGE11_WRITE_PROTECT              SYSCFG_SWP0_P11WP                                 /*!<SRAM1 page 11 write protection */
#define SRAM1_PAGE12_WRITE_PROTECT              SYSCFG_SWP0_P12WP                                 /*!<SRAM1 page 12 write protection */
#define SRAM1_PAGE13_WRITE_PROTECT              SYSCFG_SWP0_P13WP                                 /*!<SRAM1 page 13 write protection */
#define SRAM1_PAGE14_WRITE_PROTECT              SYSCFG_SWP0_P14WP                                 /*!<SRAM1 page 14 write protection */
#define SRAM1_PAGE15_WRITE_PROTECT              SYSCFG_SWP0_P15WP                                 /*!<SRAM1 page 15 write protection */
#define SRAM1_PAGE16_WRITE_PROTECT              SYSCFG_SWP0_P16WP                                 /*!<SRAM1 page 16 write protection */
#define SRAM1_PAGE17_WRITE_PROTECT              SYSCFG_SWP0_P17WP                                 /*!<SRAM1 page 17 write protection */
#define SRAM1_PAGE18_WRITE_PROTECT              SYSCFG_SWP0_P18WP                                 /*!<SRAM1 page 18 write protection */
#define SRAM1_PAGE19_WRITE_PROTECT              SYSCFG_SWP0_P19WP                                 /*!<SRAM1 page 19 write protection */
#define SRAM1_PAGE20_WRITE_PROTECT              SYSCFG_SWP0_P20WP                                 /*!<SRAM1 page 20 write protection */
#define SRAM1_PAGE21_WRITE_PROTECT              SYSCFG_SWP0_P21WP                                 /*!<SRAM1 page 21 write protection */
#define SRAM1_PAGE22_WRITE_PROTECT              SYSCFG_SWP0_P22WP                                 /*!<SRAM1 page 22 write protection */
#define SRAM1_PAGE23_WRITE_PROTECT              SYSCFG_SWP0_P23WP                                 /*!<SRAM1 page 23 write protection */
#define SRAM1_PAGE24_WRITE_PROTECT              SYSCFG_SWP0_P24WP                                 /*!<SRAM1 page 24 write protection */
#define SRAM1_PAGE25_WRITE_PROTECT              SYSCFG_SWP0_P25WP                                 /*!<SRAM1 page 25 write protection */
#define SRAM1_PAGE26_WRITE_PROTECT              SYSCFG_SWP0_P26WP                                 /*!<SRAM1 page 26 write protection */
#define SRAM1_PAGE27_WRITE_PROTECT              SYSCFG_SWP0_P27WP                                 /*!<SRAM1 page 27 write protection */
#define SRAM1_PAGE28_WRITE_PROTECT              SYSCFG_SWP0_P28WP                                 /*!<SRAM1 page 28 write protection */
#define SRAM1_PAGE29_WRITE_PROTECT              SYSCFG_SWP0_P29WP                                 /*!<SRAM1 page 29 write protection */
#define SRAM1_PAGE30_WRITE_PROTECT              SYSCFG_SWP0_P30WP                                 /*!<SRAM1 page 30 write protection */
#define SRAM1_PAGE31_WRITE_PROTECT              SYSCFG_SWP0_P31WP                                 /*!<SRAM1 page 31 write protection */
#define SRAM1_PAGE32_WRITE_PROTECT              SYSCFG_SWP1_P32WP                                 /*!<SRAM1 page 32 write protection */
#define SRAM1_PAGE33_WRITE_PROTECT              SYSCFG_SWP1_P33WP                                 /*!<SRAM1 page 33 write protection */
#define SRAM1_PAGE34_WRITE_PROTECT              SYSCFG_SWP1_P34WP                                 /*!<SRAM1 page 34 write protection */
#define SRAM1_PAGE35_WRITE_PROTECT              SYSCFG_SWP1_P35WP                                 /*!<SRAM1 page 35 write protection */
#define SRAM1_PAGE36_WRITE_PROTECT              SYSCFG_SWP1_P36WP                                 /*!<SRAM1 page 36 write protection */
#define SRAM1_PAGE37_WRITE_PROTECT              SYSCFG_SWP1_P37WP                                 /*!<SRAM1 page 37 write protection */
#define SRAM1_PAGE38_WRITE_PROTECT              SYSCFG_SWP1_P38WP                                 /*!<SRAM1 page 38 write protection */
#define SRAM1_PAGE39_WRITE_PROTECT              SYSCFG_SWP1_P39WP                                 /*!<SRAM1 page 39 write protection */
#define SRAM1_PAGE40_WRITE_PROTECT              SYSCFG_SWP1_P40WP                                 /*!<SRAM1 page 40 write protection */
#define SRAM1_PAGE41_WRITE_PROTECT              SYSCFG_SWP1_P41WP                                 /*!<SRAM1 page 41 write protection */
#define SRAM1_PAGE42_WRITE_PROTECT              SYSCFG_SWP1_P42WP                                 /*!<SRAM1 page 42 write protection */
#define SRAM1_PAGE43_WRITE_PROTECT              SYSCFG_SWP1_P43WP                                 /*!<SRAM1 page 43 write protection */
#define SRAM1_PAGE44_WRITE_PROTECT              SYSCFG_SWP1_P44WP                                 /*!<SRAM1 page 44 write protection */
#define SRAM1_PAGE45_WRITE_PROTECT              SYSCFG_SWP1_P45WP                                 /*!<SRAM1 page 45 write protection */
#define SRAM1_PAGE46_WRITE_PROTECT              SYSCFG_SWP1_P46WP                                 /*!<SRAM1 page 46 write protection */
#define SRAM1_PAGE47_WRITE_PROTECT              SYSCFG_SWP1_P47WP                                 /*!<SRAM1 page 47 write protection */
#define SRAM1_PAGE48_WRITE_PROTECT              SYSCFG_SWP1_P48WP                                 /*!<SRAM1 page 48 write protection */
#define SRAM1_PAGE49_WRITE_PROTECT              SYSCFG_SWP1_P49WP                                 /*!<SRAM1 page 49 write protection */
#define SRAM1_PAGE50_WRITE_PROTECT              SYSCFG_SWP1_P50WP                                 /*!<SRAM1 page 50 write protection */
#define SRAM1_PAGE51_WRITE_PROTECT              SYSCFG_SWP1_P51WP                                 /*!<SRAM1 page 51 write protection */
#define SRAM1_PAGE52_WRITE_PROTECT              SYSCFG_SWP1_P52WP                                 /*!<SRAM1 page 52 write protection */
#define SRAM1_PAGE53_WRITE_PROTECT              SYSCFG_SWP1_P53WP                                 /*!<SRAM1 page 53 write protection */
#define SRAM1_PAGE54_WRITE_PROTECT              SYSCFG_SWP1_P54WP                                 /*!<SRAM1 page 54 write protection */
#define SRAM1_PAGE55_WRITE_PROTECT              SYSCFG_SWP1_P55WP                                 /*!<SRAM1 page 55 write protection */
#define SRAM1_PAGE56_WRITE_PROTECT              SYSCFG_SWP1_P56WP                                 /*!<SRAM1 page 56 write protection */
#define SRAM1_PAGE57_WRITE_PROTECT              SYSCFG_SWP1_P57WP                                 /*!<SRAM1 page 57 write protection */
#define SRAM1_PAGE58_WRITE_PROTECT              SYSCFG_SWP1_P58WP                                 /*!<SRAM1 page 58 write protection */
#define SRAM1_PAGE59_WRITE_PROTECT              SYSCFG_SWP1_P59WP                                 /*!<SRAM1 page 59 write protection */
#define SRAM1_PAGE60_WRITE_PROTECT              SYSCFG_SWP1_P60WP                                 /*!<SRAM1 page 60 write protection */
#define SRAM1_PAGE61_WRITE_PROTECT              SYSCFG_SWP1_P61WP                                 /*!<SRAM1 page 61 write protection */
#define SRAM1_PAGE62_WRITE_PROTECT              SYSCFG_SWP1_P62WP                                 /*!<SRAM1 page 62 write protection */
#define SRAM1_PAGE63_WRITE_PROTECT              SYSCFG_SWP1_P63WP                                 /*!<SRAM1 page 63 write protection */

#if defined(GD32F5HC)
/* SYSCFG_TIMERCFG definitions */
#define SYSCFG_TIMER0                           ((uint8_t)0x00U)                                  /*!< SYSCFG TIMER0 */
#define SYSCFG_TIMER1                           ((uint8_t)0x01U)                                  /*!< SYSCFG TIMER1 */
#define SYSCFG_TIMER2                           ((uint8_t)0x02U)                                  /*!< SYSCFG TIMER2 */
#define SYSCFG_TIMER3                           ((uint8_t)0x03U)                                  /*!< SYSCFG TIMER3 */
#define SYSCFG_TIMER4                           ((uint8_t)0x04U)                                  /*!< SYSCFG TIMER4 */
#endif /* defined (GD32F5HC) */

/* function declarations */
/* initialization functions */
/* reset the SYSCFG registers */
void syscfg_deinit(void);
/* configure the GPIO pin as EXTI Line */
void syscfg_exti_line_config(uint8_t exti_port, uint8_t exti_pin);
/* enable the compensation cell */
void syscfg_compensation_pwdn_mode_enable(void);
/* disable the compensation cell */
void syscfg_compensation_pwdn_mode_disable(void);
/* configure SYSCFG clock control security */
void syscfg_clock_access_security_config(uint32_t access_mode);
/* configure ClassB security */
void syscfg_classb_access_security_config(uint32_t access_mode);
/* configure SRAM1 security */
void syscfg_sram1_access_security_config(uint32_t access_mode);
/* configure FPU security */
void syscfg_fpu_access_security_config(uint32_t access_mode);
/* disable VTOR_NS register write */
void syscfg_vtor_ns_write_disable(void);
/* disable Non-secure MPU registers write */
void syscfg_mpu_ns_write_disable(void);
/* disable VTOR_S register PRIS and BFHFNMINS bits in the AIRCR register write */
void syscfg_vtors_aircr_write_disable(void);
/* disable secure MPU registers writes */
void syscfg_mpu_s_write_disable(void);
/* disable SAU registers write */
void syscfg_sau_write_disable(void);
/* connect TIMER0/15/16 break input to the selected parameter */
void syscfg_lock_config(uint32_t syscfg_lock);
/* write data to GSSA */
void syscfg_gssacmd_write_data(uint8_t data);

/* SRAM1 operation functions */
/* enable sram1 erase */
ErrStatus syscfg_sram1_erase(void);
/* unlock the write protection of the SRAM1ERS bit in the SYSCFG_SCS register */
void syscfg_sram1_unlock(void);
/* lock the write protection of the SRAM1ERS bit in the SYSCFG_SCS register */
void syscfg_sram1_lock(void);
/* SRAM1 write protect range from page0 to page31 */
void syscfg_sram1_write_protect_0_31(uint32_t page);
/* SRAM1 write protect range from page32 to page63 */
void syscfg_sram1_write_protect_32_63(uint32_t page);

/* flag & interrupt functions */
/* get the compensation ready flag */
FlagStatus syscfg_compensation_ready_flag_get(void);
/* get SRAM1 erase busy flag */
FlagStatus syscfg_sram1_bsy_flag_get(void);
/* enable floating point unit interrupt */
void syscfg_fpu_interrupt_enable(uint32_t interrupt);
/* disable floating point unit interrupt */
void syscfg_fpu_interrupt_disable(uint32_t interrupt);

#endif /* gd32w51x_f5hc_SYSCFG_H */
